use_cuter3_NLP=True

from multiprocessing import cpu_count
cores=cpu_count()

output_name='final_op21_neww2v_30.csv'

num_of_word_extract=20

already_have_set=False

modify_kw = {
    'D090597': ('oppo', 'OPPO'),
    'D085467': ('两', '二'),
    'D014914': ('显', '星'),
    'D077214': ('mv', 'MV'),
    'D083214': (' LoveLive! Sunshine!!', 'LoveLive!Sunshine!!'),
    'D037494': ('包贝儿', '包贝尔'),
    'D002857': ('赵本山女儿', '女儿'),
    'D096492': ('Office 365', 'Office365'),
    'D074723': ('Ashi Studio', 'AshiStudio'),
    'D073936': ('留学预算', '预算'),
    'D038769': ('BIG YELL', 'BIGYELL'),
    'D024936': ('徐静蕾', '贾静雯'),
    'D019060': ('上海外滩', '外滩'),
    'D065844': ('几口', '忌口'),
    'D106475': ('Ryzen 2400GE', 'Ryzen2400GE'),
    'D042223': ('东京奥运会', '东京奥运'),
    'D022938': ('全民尴舞', '全民尬舞'),
    'D038892': ('SWIN SUGAR PARTY', 'SWINSUGARPARTY'),
    'D015709': ('The Story of Light', 'TheStoryofLight'),
    'D023306': ('王思聪新女友', '新女友'),
    'D089659': ('魅族新机', '魅蓝新机'),
    'D020451': ('消防队员', '消防战士'),
    'D098819': ('微博鸡米花', '微波鸡米花'),
    'D016254': ('回忆车祸', '车祸'),
    'D094379': ('BOOX Note S', 'BOOXNoteS'),
    'D073702': ('安全事故', '事故'),
    'D068752': ('铺食', '辅食'),
    'D056716': ('歼15', '歼-15'),
    'D054667': ('战绩', '战机'),
    'D011909': ('泰荣君', '泰容'),
    'D045072': ('实物', '食物'),
    'D050949': ('小儿徐麻疹', '荨麻疹'),
    'D014466': ("'萧煌奇", '萧煌奇'),
    'D008790': ('妹夫', '姐夫'),
    'D012538': ('起子', '妻子'),
    'D008779': ('男性', '男星'),
    'D092295': ('极客帮', '极客邦'),
    'D025483': ('美人坯子', '美人胚子'),
    'D000210': ('陈列', '陈烈'),
}

modify_title = {
    'D103531': ('开胃神菜', '开胃菜'),
    'D051755': ('这些病', '这些疾病'),
    'D018758': ('来路正不正', '来路不正'),
}

